; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-7-28)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p2-0 - location
	p3-0 - location
	p3-2 - location
	p4-1 - location
	p4-2 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s0)
	(at driver3 s2)
	(at driver4 s3)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at truck5 s1)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at truck7 s0)
	(empty truck7)
	(at package1 s3)
	(at package2 s2)
	(at package3 s4)
	(at package4 s4)
	(at package5 s3)
	(at package6 s1)
	(at package7 s4)
	(at package8 s4)
	(at package9 s0)
	(at package10 s3)
	(at package11 s4)
	(at package12 s2)
	(at package13 s0)
	(at package14 s2)
	(at package15 s0)
	(at package16 s4)
	(at package17 s4)
	(at package18 s3)
	(at package19 s0)
	(at package20 s3)
	(at package21 s0)
	(at package22 s2)
	(at package23 s1)
	(at package24 s0)
	(at package25 s3)
	(at package26 s0)
	(at package27 s0)
	(at package28 s2)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s3 p3-2)
	(path p3-2 s3)
	(path s2 p3-2)
	(path p3-2 s2)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s1 s2)
	(link s2 s1)
	(link s2 s3)
	(link s3 s2)
	(link s2 s4)
	(link s4 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s4)
	(link s4 s3)
	(link s4 s0)
	(link s0 s4)
)
	(:goal (and
	(at driver1 s3)
	(at driver2 s1)
	(at driver3 s0)
	(at truck1 s1)
	(at truck2 s0)
	(at truck3 s0)
	(at truck6 s4)
	(at truck7 s4)
	(at package1 s4)
	(at package2 s1)
	(at package3 s0)
	(at package4 s4)
	(at package5 s3)
	(at package6 s2)
	(at package7 s1)
	(at package8 s3)
	(at package9 s2)
	(at package10 s3)
	(at package11 s1)
	(at package12 s4)
	(at package13 s3)
	(at package14 s2)
	(at package15 s0)
	(at package17 s1)
	(at package18 s1)
	(at package19 s1)
	(at package20 s4)
	(at package21 s4)
	(at package22 s2)
	(at package23 s3)
	(at package24 s0)
	(at package25 s1)
	(at package26 s0)
	(at package27 s0)
	(at package28 s3)
	))


)

; plan
1. (board-truck driver4 s3 truck4)
   deleted: (at driver4 s3) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 10 of 35
2. (load-truck s3 package25 truck4)
   deleted: (at package25 s3)
   added: (in package25 truck4)
   goals met: 10 of 35
3. (drive-truck driver4 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 10 of 35
4. (load-truck s2 package28 truck4)
   deleted: (at package28 s2)
   added: (in package28 truck4)
   goals met: 10 of 35
5. (load-truck s2 package2 truck4)
   deleted: (at package2 s2)
   added: (in package2 truck4)
   goals met: 10 of 35
6. (load-truck s2 package12 truck4)
   deleted: (at package12 s2)
   added: (in package12 truck4)
   goals met: 10 of 35
7. (drive-truck driver4 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 10 of 35
8. (drive-truck driver4 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 10 of 35
9. (load-truck s4 package8 truck4)
   deleted: (at package8 s4)
   added: (in package8 truck4)
   goals met: 10 of 35
10. (drive-truck driver4 s4 s3 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s3)
   goals met: 10 of 35
11. (unload-truck s3 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s3)
   goals met: 11 of 35
12. (unload-truck s3 package28 truck4)
   deleted: (in package28 truck4)
   added: (at package28 s3)
   goals met: 12 of 35
13. (drive-truck driver4 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 12 of 35
14. (load-truck s4 package7 truck4)
   deleted: (at package7 s4)
   added: (in package7 truck4)
   goals met: 12 of 35
15. (drive-truck driver4 s4 s2 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   goals met: 12 of 35
16. (drive-truck driver4 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 12 of 35
17. (unload-truck s1 package7 truck4)
   deleted: (in package7 truck4)
   added: (at package7 s1)
   goals met: 13 of 35
18. (load-truck s1 package6 truck4)
   deleted: (at package6 s1)
   added: (in package6 truck4)
   goals met: 13 of 35
19. (drive-truck driver4 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 13 of 35
20. (unload-truck s2 package6 truck4)
   deleted: (in package6 truck4)
   added: (at package6 s2)
   goals met: 14 of 35
21. (drive-truck driver4 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 14 of 35
22. (load-truck s3 package20 truck4)
   deleted: (at package20 s3)
   added: (in package20 truck4)
   goals met: 14 of 35
23. (drive-truck driver4 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 14 of 35
24. (load-truck s4 package3 truck4)
   deleted: (at package3 s4)
   added: (in package3 truck4)
   goals met: 14 of 35
25. (drive-truck driver4 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 14 of 35
26. (load-truck s0 package9 truck4)
   deleted: (at package9 s0)
   added: (in package9 truck4)
   goals met: 14 of 35
27. (unload-truck s0 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s0)
   goals met: 15 of 35
28. (load-truck s0 package21 truck4)
   deleted: (at package21 s0)
   added: (in package21 truck4)
   goals met: 15 of 35
29. (load-truck s0 package19 truck4)
   deleted: (at package19 s0)
   added: (in package19 truck4)
   goals met: 15 of 35
30. (load-truck s0 package13 truck4)
   deleted: (at package13 s0)
   added: (in package13 truck4)
   goals met: 15 of 35
31. (drive-truck driver4 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 15 of 35
32. (unload-truck s2 package9 truck4)
   deleted: (in package9 truck4)
   added: (at package9 s2)
   goals met: 16 of 35
33. (drive-truck driver4 s2 s4 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   goals met: 16 of 35
34. (unload-truck s4 package21 truck4)
   deleted: (in package21 truck4)
   added: (at package21 s4)
   goals met: 17 of 35
35. (unload-truck s4 package20 truck4)
   deleted: (in package20 truck4)
   added: (at package20 s4)
   goals met: 18 of 35
36. (drive-truck driver4 s4 s2 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   goals met: 18 of 35
37. (board-truck driver1 s4 truck2)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 18 of 35
38. (drive-truck driver4 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 18 of 35
39. (unload-truck s1 package25 truck4)
   deleted: (in package25 truck4)
   added: (at package25 s1)
   goals met: 19 of 35
40. (load-truck s1 package23 truck4)
   deleted: (at package23 s1)
   added: (in package23 truck4)
   goals met: 19 of 35
41. (drive-truck driver4 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 19 of 35
42. (drive-truck driver4 s2 s3 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s3)
   goals met: 19 of 35
43. (unload-truck s3 package23 truck4)
   deleted: (in package23 truck4)
   added: (at package23 s3)
   goals met: 20 of 35
44. (load-truck s3 package18 truck4)
   deleted: (at package18 s3)
   added: (in package18 truck4)
   goals met: 20 of 35
45. (unload-truck s3 package13 truck4)
   deleted: (in package13 truck4)
   added: (at package13 s3)
   goals met: 21 of 35
46. (drive-truck driver4 s3 s2 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s2)
   goals met: 21 of 35
47. (drive-truck driver4 s2 s1 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s1)
   goals met: 21 of 35
48. (unload-truck s1 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s1)
   goals met: 22 of 35
49. (unload-truck s1 package19 truck4)
   deleted: (in package19 truck4)
   added: (at package19 s1)
   goals met: 23 of 35
50. (unload-truck s1 package18 truck4)
   deleted: (in package18 truck4)
   added: (at package18 s1)
   goals met: 24 of 35
51. (drive-truck driver4 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 24 of 35
52. (drive-truck driver4 s2 s4 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   goals met: 24 of 35
53. (disembark-truck driver4 s4 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s4) (empty truck4)
   goals met: 24 of 35
54. (unload-truck s4 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s4)
   goals met: 25 of 35
55. (board-truck driver4 s4 truck3)
   deleted: (at driver4 s4) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 25 of 35
56. (drive-truck driver4 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 26 of 35
57. (board-truck driver2 s0 truck7)
   deleted: (at driver2 s0) (empty truck7)
   added: (driving driver2 truck7)
   goals met: 26 of 35
58. (drive-truck driver1 s4 s3 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   goals met: 26 of 35
59. (drive-truck driver4 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 25 of 35
60. (load-truck s3 package1 truck2)
   deleted: (at package1 s3)
   added: (in package1 truck2)
   goals met: 25 of 35
61. (load-truck s4 package17 truck3)
   deleted: (at package17 s4)
   added: (in package17 truck3)
   goals met: 25 of 35
62. (drive-truck driver4 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 26 of 35
63. (drive-truck driver2 s0 s4 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   goals met: 27 of 35
64. (load-truck s4 package11 truck7)
   deleted: (at package11 s4)
   added: (in package11 truck7)
   goals met: 27 of 35
65. (drive-truck driver2 s4 s2 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s2)
   goals met: 26 of 35
66. (drive-truck driver2 s2 s1 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s1)
   goals met: 26 of 35
67. (unload-truck s1 package11 truck7)
   deleted: (in package11 truck7)
   added: (at package11 s1)
   goals met: 27 of 35
68. (walk driver3 s2 p0-2)
   deleted: (at driver3 s2)
   added: (at driver3 p0-2)
   goals met: 27 of 35
69. (drive-truck driver4 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 26 of 35
70. (unload-truck s1 package17 truck3)
   deleted: (in package17 truck3)
   added: (at package17 s1)
   goals met: 27 of 35
71. (drive-truck driver4 s1 s0 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s0)
   goals met: 28 of 35
72. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 29 of 35
73. (drive-truck driver4 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 28 of 35
74. (walk driver3 p0-2 s0)
   deleted: (at driver3 p0-2)
   added: (at driver3 s0)
   goals met: 29 of 35
75. (disembark-truck driver4 s3 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s3) (empty truck3)
   goals met: 29 of 35
76. (board-truck driver4 s3 truck1)
   deleted: (at driver4 s3) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 29 of 35
77. (drive-truck driver4 s3 s2 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s2)
   goals met: 29 of 35
78. (drive-truck driver4 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 30 of 35
79. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 29 of 35
80. (drive-truck driver2 s1 s2 truck7)
   deleted: (at truck7 s1)
   added: (at truck7 s2)
   goals met: 29 of 35
81. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 30 of 35
82. (drive-truck driver2 s2 s3 truck7)
   deleted: (at truck7 s2)
   added: (at truck7 s3)
   goals met: 30 of 35
83. (disembark-truck driver2 s3 truck7)
   deleted: (driving driver2 truck7)
   added: (at driver2 s3) (empty truck7)
   goals met: 30 of 35
84. (board-truck driver2 s3 truck3)
   deleted: (at driver2 s3) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 30 of 35
85. (drive-truck driver2 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 31 of 35
86. (drive-truck driver1 s0 s3 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   goals met: 30 of 35
87. (disembark-truck driver1 s3 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s3) (empty truck2)
   goals met: 31 of 35
88. (board-truck driver1 s3 truck7)
   deleted: (at driver1 s3) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 30 of 35
89. (unload-truck s3 package1 truck2)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   goals met: 30 of 35
90. (drive-truck driver1 s3 s4 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s4)
   goals met: 31 of 35
91. (drive-truck driver2 s0 s3 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s3)
   goals met: 30 of 35
92. (load-truck s3 package1 truck3)
   deleted: (at package1 s3)
   added: (in package1 truck3)
   goals met: 30 of 35
93. (drive-truck driver2 s3 s0 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s0)
   goals met: 31 of 35
94. (drive-truck driver1 s4 s3 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s3)
   goals met: 30 of 35
95. (disembark-truck driver1 s3 truck7)
   deleted: (driving driver1 truck7)
   added: (at driver1 s3) (empty truck7)
   goals met: 31 of 35
96. (drive-truck driver2 s0 s4 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s4)
   goals met: 30 of 35
97. (unload-truck s4 package1 truck3)
   deleted: (in package1 truck3)
   added: (at package1 s4)
   goals met: 31 of 35
98. (disembark-truck driver2 s4 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 31 of 35
99. (walk driver2 s4 p4-1)
   deleted: (at driver2 s4)
   added: (at driver2 p4-1)
   goals met: 31 of 35
100. (board-truck driver1 s3 truck2)
   deleted: (at driver1 s3) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 30 of 35
101. (drive-truck driver1 s3 s0 truck2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   goals met: 31 of 35
102. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   goals met: 30 of 35
103. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   goals met: 30 of 35
104. (board-truck driver3 s3 truck7)
   deleted: (at driver3 s3) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 30 of 35
105. (drive-truck driver3 s3 s0 truck7)
   deleted: (at truck7 s3)
   added: (at truck7 s0)
   goals met: 30 of 35
106. (disembark-truck driver3 s0 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s0) (empty truck7)
   goals met: 31 of 35
107. (walk driver2 p4-1 s1)
   deleted: (at driver2 p4-1)
   added: (at driver2 s1)
   goals met: 32 of 35
108. (walk driver3 s0 p0-4)
   deleted: (at driver3 s0)
   added: (at driver3 p0-4)
   goals met: 31 of 35
109. (walk driver3 p0-4 s4)
   deleted: (at driver3 p0-4)
   added: (at driver3 s4)
   goals met: 31 of 35
110. (disembark-truck driver1 s0 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 31 of 35
111. (walk driver1 s0 p0-3)
   deleted: (at driver1 s0)
   added: (at driver1 p0-3)
   goals met: 31 of 35
112. (walk driver1 p0-3 s3)
   deleted: (at driver1 p0-3)
   added: (at driver1 s3)
   goals met: 32 of 35
113. (walk driver3 s4 p0-4)
   deleted: (at driver3 s4)
   added: (at driver3 p0-4)
   goals met: 32 of 35
114. (walk driver3 p0-4 s0)
   deleted: (at driver3 p0-4)
   added: (at driver3 s0)
   goals met: 33 of 35
115. (board-truck driver3 s0 truck7)
   deleted: (at driver3 s0) (empty truck7)
   added: (driving driver3 truck7)
   goals met: 32 of 35
116. (drive-truck driver3 s0 s4 truck7)
   deleted: (at truck7 s0)
   added: (at truck7 s4)
   goals met: 33 of 35
117. (disembark-truck driver3 s4 truck7)
   deleted: (driving driver3 truck7)
   added: (at driver3 s4) (empty truck7)
   goals met: 33 of 35
118. (board-truck driver3 s4 truck3)
   deleted: (at driver3 s4) (empty truck3)
   added: (driving driver3 truck3)
   goals met: 33 of 35
119. (drive-truck driver3 s4 s0 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s0)
   goals met: 34 of 35
120. (disembark-truck driver3 s0 truck3)
   deleted: (driving driver3 truck3)
   added: (at driver3 s0) (empty truck3)
   goals met: 35 of 35
